## Data Loading

In [1]:
# Loading packages
import pandas as pd
import numpy as np

In [2]:
#import and read data
df = pd.read_csv('titanic_row.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

 - Here, our predicted feature is `survived` column and `PassengerId`, `Name`, `Ticket`, `Fare`, `Cabin` columns are not contributed to find the output. Also,

## Data Processing

In [4]:
df.shape #shape of dataset(rows, columns)

(891, 12)

In [5]:
df.columns #columns name

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df.info() #gives details about datatype and non-null value count

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
# missing values in dataset
missing_value = df.isnull().sum()
missing_value

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

- In `Cabin` approximately 80% of data is missing so dropping column will not effect our dataset.

In [8]:
# Use the drop method to remove column
df = df.drop(columns='Cabin')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [9]:
# remove rows which contain missing values in Embarked
df.dropna(subset=['Embarked'], inplace=True)

- Here, in `Age` we have nearly 20% of missing value so we will fill that blanks with median.

In [10]:
# median of age column
age_median = df['Age'].median()
age_median

28.0

In [11]:
#filling missing value with median
df['Age'].fillna(age_median, inplace=True)

In [12]:
#To check if any missing value avaiable
missing_value = df.isnull().sum()
missing_value

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

 - Here, columns such as `PassengerId`, `Name`, `Ticket`, `Fare` are not necessary, so we remove these columns.

In [13]:
# List of columns to be removed
columns_to_remove = ['PassengerId', 'Name', 'Ticket', 'Fare']

# Use the drop method to remove the specified columns
df = df.drop(columns=columns_to_remove)

In [14]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S

In [15]:
# Exporting csv file
df.to_csv('../database/titanic.csv', index=False)